{
	"pluginmetadataversion" : 2,
	"name": "Clean Tricks",
	"type": ["core", "ui", "architecture", "binaryview", "helper"],
	"api": ["python3"],
	"description": "This plugin removes some simple known obfuscation techniques to cut down on the tedium.",
	"longdescription": "Binary Ninja plugin to clean up some common obfuscation techniques (dirty tricks). <br><br>There is an empty template included as well to be able to easily add your own, because there are many many obfuscations out there. However, often they get reused or slightly modified, and then it is useful to have a starting point/example. Pull requests are very welcome.<br><br>More details available at:<br><a href='https://www.janbeck.com/cybersecurity-challenges-ctfs-and-more/cleantricks-to-deal-with-dirty-tricks-binary-ninja-deobfuscation-plugin'>https://www.janbeck.com/cybersecurity-challenges-ctfs-and-more/cleantricks-to-deal-with-dirty-tricks-binary-ninja-deobfuscation-plugin</a><br><br>But as a simple example of what this is for, consider the following code:<br><br><img src='https://raw.githubusercontent.com/janbbeck/CleanTricks/master/readme_pics/code_before.png'><br><br>The overlapping code is hidden in the literal value, 0x5ebcbff49c3ff49. It simply increases r11, then decreases it again, then jumps to the address right behind the JZ check. I have come across a binary that uses this same trick on different registers thousands of times. This plugin allows automating this patch:<br><br><img src='https://raw.githubusercontent.com/janbbeck/CleanTricks/master/readme_pics/menu.png'><br><br>And then, after the patch, the code is much simpler. In many cases this allows binary ninja to reanalyze the program flow into a much more convienient form.<br><br><img src='https://raw.githubusercontent.com/janbbeck/CleanTricks/master/readme_pics/code_after.png'>",
	"license": {
		"name": "MIT",
		"text": "Copyright (c) <year> <copyright holders>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {
		"Darwin" : "",
		"Linux" : "",
		"Windows" : ""
	},
	"dependencies": {
		"pip": [],
		"apt": [],
		"installers": [],
		"other": []
	},
	"version": "1.4",
	"author": "Jan Beck",
	"minimumbinaryninjaversion": 1200
}
